Revit 2020 API
ImageImportOptions Class
Options used to import specific image formats and place an instance of them on a view or sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public class ImageImportOptions : GenericImportOptions
Visual Basic
Public Class ImageImportOptions _
	Inherits GenericImportOptions
Visual C++
public ref class ImageImportOptions : public GenericImportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GenericImportOptions
 Autodesk.Revit.DB.ImageImportOptions
See Also
ImageImportOptions Members
Autodesk.Revit.DB Namespace